PImage img;
int [][] pos = {{83,454},{93,491},{108,525},{118,457},{128,488},{144,525},{151,456},{161,491},{177,524},{185,456},{195,490},{211,524},{220,457},{231,490},{246,525},{253,457},{264,491},{281,523},{288,456},{297,490},{315,525},{322,457},{331,491},{356,457},{363,490},{388,455}};
void setup(){
  size(800,600);
  img = loadImage("keyboard.png");
  rectMode(CENTER);//用中心點，來畫四邊形
}
void draw(){
  background(#FFFFF2);//淡黃色，清背景
  fill(0,255,0,128);//半透明(128)的綠色
  image(img,0,600-266);
  rect(mouseX,mouseY,28,30,5);
  for(int i=0;i<26;i++){
    rect(pos[i][0],pos[i][1],28,30,5);
  }
}
void mousePressed(){
  println(mouseX,mouseY);//定位、印出mouse座標
}
